CosmOS-Creators/stm32h755_integration_HAL/CIL/inc/CILinterrupt.h
/********************************************************************************
**                                                                             **
**                         COSMOS FILE | CREATED BY HUMAN                      **
**                                                                             **
*********************************************************************************
**                       DOXYGEN DOCUMENTATION INFORMATION                     **
*****************************************************************************//**
** @file CILinterrupt.h
*********************************************************************************
<!--                     CILinterrupt Unit Group Definition                   -->
*********************************************************************************
** @defgroup CILinterrupt_unit CILinterrupt Unit
** @ingroup CIL_module
** @brief CILinterrupt Unit
** @details lorem
*********************************************************************************
<!--                           Version Information                            -->
*********************************************************************************
** @version 1.0.0
** @date 1.8.2020
** @author https://github.com/PavolKostolansky
*********************************************************************************
<!--                          Warnings and License                            -->
*********************************************************************************
** @warning Modifying code can lead to unexpected behaviour of the whole system
** @copyright MIT License
*********************************************************************************
<!--                CILinterrupt Unit Global Group Definition                 -->
*********************************************************************************
** @defgroup Global_CILinterrupt Global
** @ingroup CILinterrupt_unit
** @brief CILinterrupt globals
** @details lorem
********************************************************************************/
/********************************************************************************
**                           START OF THE HEADER FILE                          **
********************************************************************************/
#ifndef __CILINTERRUPT_H__
#define __CILINTERRUPT_H__
/********************************************************************************
**                         START OF C++ SUPPORT SECTION                        **
********************************************************************************/
#ifdef __cplusplus
extern "C" {
#endif
/********************************************************************************
**                            Include Files | Start                            **
********************************************************************************/
/* CORE interfaces */
#include "core.h"
#include "memoryMapping.h"
#include "scheduler.h"
#include "sysDefs.h"

/* CIL interfaces */
#include "CILstdTypes.h"

/* HAL interfaces */
#include "stm32h7xx_hal.h"
/********************************************************************************
**                            Include Files | Stop                             **
********************************************************************************/
/********************************************************************************
**                          Macro Definitions | Start                          **
********************************************************************************/
/********************************************************************************
  * DOXYGEN START GROUP                                                        **
  * *************************************************************************//**
  * @defgroup Macros_CILinterrupt_h Macros
  * @ingroup Global_CILinterrupt
  * @{
********************************************************************************/
/********************************************************************************
  * DOXYGEN STOP GROUP                                                         **
  * *************************************************************************//**
  * @} */
/*  Macros_CILinterrupt_h
********************************************************************************/
/********************************************************************************
**                          Macro Definitions | Stop                           **
********************************************************************************/
/********************************************************************************
**                              Variables | Start                              **
********************************************************************************/
/********************************************************************************
  * DOXYGEN START GROUP                                                        **
  * *************************************************************************//**
  * @defgroup Variables_CILinterrupt_h Variables
  * @ingroup Global_CILinterrupt
  * @{
********************************************************************************/
/********************************************************************************
  * DOXYGEN STOP GROUP                                                         **
  * *************************************************************************//**
  * @} */
/*  Variables_CILinterrupt_h
********************************************************************************/
/********************************************************************************
**                              Variables | Stop                               **
********************************************************************************/
/********************************************************************************
**                         Function Prototypes | Start                         **
********************************************************************************/
/********************************************************************************
  * DOXYGEN DEF GROUP                                                          **
  * *************************************************************************//**
  * @defgroup Apis_CILinterrupt_h API's
  * @ingroup Global_CILinterrupt
********************************************************************************/
/********************************************************************************
  * DOXYGEN START GROUP                                                        **
  * *************************************************************************//**
  * @addtogroup Getters_CILinterrupt_h Getters
  * @ingroup Apis_CILinterrupt_h
  * @{
********************************************************************************/
/********************************************************************************
  * DOXYGEN STOP GROUP                                                         **
  * *************************************************************************//**
  * @} */
/*  Getters_CILinterrupt_h
********************************************************************************/
/********************************************************************************
  * DOXYGEN START GROUP                                                        **
  * *************************************************************************//**
  * @addtogroup Setters_CILinterrupt_h Setters
  * @ingroup Apis_CILinterrupt_h
  * @{
********************************************************************************/
/********************************************************************************
  * DOXYGEN STOP GROUP                                                         **
  * *************************************************************************//**
  * @} */
/*  Setters_CILinterrupt_h
********************************************************************************/
/********************************************************************************
  * DOXYGEN START GROUP                                                        **
  * *************************************************************************//**
  * @addtogroup General_CILinterrupt_h General
  * @ingroup Apis_CILinterrupt_h
  * @{
********************************************************************************/
/********************************************************************************
  * DOXYGEN STOP GROUP                                                         **
  * *************************************************************************//**
  * @} */
/*  General_CILinterrupt_h
********************************************************************************/
/********************************************************************************
**                         Function Prototypes | Stop                          **
********************************************************************************/
/********************************************************************************
**                        Function Definitions | Start                         **
********************************************************************************/
/********************************************************************************
  * DOXYGEN START GROUP                                                        **
  * *************************************************************************//**
  * @addtogroup Getters_CILinterrupt_h Getters
  * @ingroup Apis_CILinterrupt_h
  * @{
********************************************************************************/
/********************************************************************************
  * DOXYGEN STOP GROUP                                                         **
  * *************************************************************************//**
  * @} */
/*  Getters_CILinterrupt_h
********************************************************************************/
/********************************************************************************
  * DOXYGEN START GROUP                                                        **
  * *************************************************************************//**
  * @addtogroup Setters_CILinterrupt_h Setters
  * @ingroup Apis_CILinterrupt_h
  * @{
********************************************************************************/
/********************************************************************************
  * DOXYGEN STOP GROUP                                                         **
  * *************************************************************************//**
  * @} */
/*  Setters_CILinterrupt_h
********************************************************************************/
/********************************************************************************
  * DOXYGEN START GROUP                                                        **
  * *************************************************************************//**
  * @addtogroup General_CILinterrupt_h General
  * @ingroup Apis_CILinterrupt_h
  * @{
********************************************************************************/
/********************************************************************************
  * DOXYGEN DOCUMENTATION INFORMATION                                          **
  * ****************************************************************************/
/**
  * @fn CILinterrupt_enableInterrupts(void)
  *
  * @brief Enable interrupts for the current core. This function cannot
  * be called from the unprivileged context directly.
  *
  * @param[in] none
  *
  * @return none
********************************************************************************/
__STATIC_FORCEINLINE void
CILinterrupt_enableInterrupts( void )
{
    __enable_irq();
}

/********************************************************************************
  * DOXYGEN DOCUMENTATION INFORMATION                                          **
  * ****************************************************************************/
/**
  * @fn CILinterrupt_enableInterrupt(BitWidthType ISR)
  *
  * @brief Enable specific interrupt for the current core. This function cannot
  * be called from the unprivileged context directly.
  *
  * @param[in]  ISR id of the interrupt
  *
  * @return none
********************************************************************************/
__STATIC_FORCEINLINE void
CILinterrupt_enableInterrupt( BitWidthType ISR )
{
    __NVIC_EnableIRQ( ISR );
}

/********************************************************************************
  * DOXYGEN DOCUMENTATION INFORMATION                                          **
  * ****************************************************************************/
/**
  * @fn CILinterrupt_disableInterrupts(void)
  *
  * @brief Disable interrupts for the current core. This function cannot
  * be called from the unprivileged context directly.
  *
  * @param[in]  none
  *
  * @return none
********************************************************************************/
__STATIC_FORCEINLINE void
CILinterrupt_disableInterrupts( void )
{
    __disable_irq();
}

/********************************************************************************
  * DOXYGEN DOCUMENTATION INFORMATION                                          **
  * ****************************************************************************/
/**
  * @fn CILinterrupt_disableInterrupt(BitWidthType ISR)
  *
  * @brief Disable specific interrupt for the current core. This function cannot
  * be called from the unprivileged context directly.
  *
  * @param[in]  ISR id of the interrupt
  *
  * @return none
********************************************************************************/
__STATIC_FORCEINLINE void
CILinterrupt_disableInterrupt( BitWidthType ISR )
{
    __NVIC_DisableIRQ( ISR );
}

/********************************************************************************
  * DOXYGEN DOCUMENTATION INFORMATION                                          **
  * ****************************************************************************/
/**
  * @fn CILinterrupt_contextSwitchRoutineTrigger(void)
  *
  * @brief Context switch routine trigger. This function cannot
  * be called from the unprivileged context directly.
  *
  * @param[in] none
  *
  * @return none
********************************************************************************/
__STATIC_FORCEINLINE void
CILinterrupt_contextSwitchRoutineTrigger( void )
{
    CosmOS_CoreConfigurationType * coreCfg;
    CosmOS_SchedulerConfigurationType * schedulerCfg;

    CosmOS_SchedulerStateType schedulerState;

    coreCfg = core_getCoreCfg();
    schedulerCfg = core_getCoreScheduler( coreCfg );

    schedulerState = scheduler_getSchedulerState( schedulerCfg );

    if ( schedulerState IS_NOT_EQUAL_TO
             SCHEDULER_STATE_ENUM__TASK_EXECUTED_IN_WCET_CHECK )
    {
        SCB->ICSR |= SCB_ICSR_PENDSVSET_Msk;
    }
}
/********************************************************************************
  * DOXYGEN STOP GROUP                                                         **
  * *************************************************************************//**
  * @} */
/*  General_CILinterrupt_h
********************************************************************************/
/********************************************************************************
**                        Function Definitions | Stop                          **
********************************************************************************/
#ifdef __cplusplus
}
#endif
/********************************************************************************
**                         END OF C++ SUPPORT SECTION                          **
********************************************************************************/
#endif
/********************************************************************************
**                           END OF THE HEADER FILE                            **
********************************************************************************/
